In [1]:
from bs4 import BeautifulSoup
import requests
import pandas as pd

# Write a python program to display all the header tags from ‘en.wikipedia.org/wiki/Main_Page’

In [25]:
page=requests.get('http://en.wikipedia.org/wiki/Main_Page')

In [26]:
soup=BeautifulSoup(page.content)

In [27]:
all_header=soup.find_all(['h1', 'h2','h3','h4','h5','h6'])

In [28]:
header=[]
for i in all_header:
  header.append(i.text.replace('\n',' '))

header

['Main Page',
 "From today's featured article",
 'Did you know\xa0...',
 'In the news',
 'On this day',
 "Today's featured picture",
 'Other areas of Wikipedia',
 "Wikipedia's sister projects",
 'Wikipedia languages',
 'Navigation menu',
 ' Personal tools ',
 ' Namespaces ',
 ' Variants ',
 ' Views ',
 ' More ',
 ' Search ',
 ' Navigation ',
 ' Contribute ',
 ' Tools ',
 ' Print/export ',
 ' In other projects ',
 ' Languages ']

# Write a python program to display IMDB’s Top rated 100 movies’ data (i.e. Name, IMDB rating, Year of release) and save it in form of a CSV file.

In [15]:
page=requests.get('https://www.imdb.com/chart/top')
page

In [16]:
soup=BeautifulSoup(page.content)

In [17]:
top_movies=soup.find_all('td', class_='titleColumn')

In [18]:
top_rating=soup.find_all('td', class_='ratingColumn imdbRating')

In [19]:
top_hun_mov=[]
top_hun_year=[]
j=0
for i in top_movies:
  top_hun_mov.append(i.text[len(str())+15:-7].replace('\n',''))
  top_hun_year.append(i.text[len(str())-6:-2].replace('\n',''))
  j=j+1
  if j >= 100:
    break

In [20]:
top_hun_rat=[]
j=0
for i in top_rating:
  top_hun_rat.append(i.text.replace('\n',''))
  j=j+1
  if j >= 100:
    break

In [21]:

top_imdb=pd.DataFrame([top_hun_mov,top_hun_rat,top_hun_year]).T
top_imdb.columns=['Name','IMDB rating','Year of release']

In [22]:
top_imdb.to_csv('top_hun_imdb.csv')

In [23]:
top_imdb

                         Name IMDB rating Year of release
0    The Shawshank Redemption         9.2            1994
1               The Godfather         9.1            1972
2      The Godfather: Part II         9.0            1974
3             The Dark Knight         9.0            2008
4                12 Angry Men         8.9            1957
..                        ...         ...             ...
95               Citizen Kane         8.3            1941
96                     Dangal         8.3            2016
97               Come and See         8.2            1985
98                    The Kid         8.2            1921
99        Singin' in the Rain         8.2            1952

[100 rows x 3 columns]

# Write a python program to display IMDB’s Top rated 100 Indian movies’ data (i.e. Name, IMDB rating, Year of release) and save it in form of a CSV file.

In [6]:
page=requests.get('https://www.imdb.com/india/top-rated-indian-movies/')
page

In [7]:
soup=BeautifulSoup(page.content)

In [8]:
top_indian_movies=soup.find_all('td', class_='titleColumn')

In [9]:
top_indian_rating=soup.find_all('td', class_='ratingColumn imdbRating')

In [10]:
top_hun_mov=[]
top_hun_year=[]
j=0
for i in top_indian_movies:
  top_hun_mov.append(i.text[len(str())+15:-7].replace('\n',''))
  top_hun_year.append(i.text[len(str())-6:-2].replace('\n',''))
  j=j+1
  if j >= 100:
    break

In [11]:
top_hun_rat=[]
j=0
for i in top_indian_rating:
  top_hun_rat.append(i.text.replace('\n',''))
  j=j+1
  if j >= 100:
    break

In [12]:

top_indian_imdb=pd.DataFrame([top_hun_mov,top_hun_rat,top_hun_year]).T
top_indian_imdb.columns=['Name','IMDB rating','Year of release']

In [13]:
top_indian_imdb.to_csv('top_ind_imdb.csv')

In [14]:
top_indian_imdb

                            Name IMDB rating Year of release
0                Pather Panchali         8.5            1955
1                    Hanky Panky         8.5            1979
2                        Nayakan         8.5            1987
3                     Anbe Sivam         8.5            2003
4               The World of Apu         8.5            1959
..                           ...         ...             ...
95    The Legend of Bhagat Singh         8.0            2002
96                        Barfi!         8.0            2012
97                          Pink         8.0            2016
98                    Bommarillu         8.0            2006
99                        Bombay         8.0            1995

[100 rows x 3 columns]

# Write a python program to scrap book name, author name, genre and book review of any 5 books from ‘www.bookpage.com’

In [ ]:
page=requests.get('https://bookpage.com/reviews')
page

In [ ]:
soup1=BeautifulSoup(page.content)

In [ ]:
book=soup1.find_all('h4', class_='italic')

auther=soup1.find_all('p', class_='sans bold')

genre=soup1.find_all('p', class_='genre-links hidden-phone')

review=soup1.find_all('p')

In [ ]:
five_book=[]
j=0
for i in book:
  #five_book.append(i.text[len(str())+15:-7].replace('\n',''))
  five_book.append(i.text.replace('\n',''))
  j=j+1
  if j >= 5:
    break

five_auther=[]
j=0
for i in auther:
  five_auther.append(i.text.replace('\n',''))
  j=j+1
  if j >= 5:
    break

five_genre=[]
j=0
for i in genre:
  five_genre.append(i.text.replace('\n',''))
  j=j+1
  if j >= 5:
    break

five_review=[]
j=0
for i in review:
  if (i.text.replace('\n','') != ''):
    five_review.append(i.text.replace('\n',''))
  j=j+1
  if j >= 20:
    break

five_review1=[]
j=0
for i in five_review:
  if j%3==0 and j!=0:
    five_review1.append(i)
  j=j+1

In [ ]:
pd.DataFrame([five_book,five_auther,five_genre,five_review1]).T

                                      0  ...                                                  3
0                      Before I Saw You  ...  Emily Houghton’s Before I Saw You is a tender,...
1                   Many Shapes of Clay  ...  Author-illustrator Kenesha Sneed is a Los Ange...
2                     The Girl Who Died  ...  The advertisement is simple and honest: “Teach...
3                          ★ Sorrowland  ...  Full of horror and love, Sorrowland is so perf...
4   ★ The Secret to Superhuman Strength  ...  Alison Bechdel’s unique combination of persona...

[5 rows x 4 columns]

# Write a python program to scrape cricket rankings from ‘www.icc-cricket.com’. You have to scrape:

##i) Top 10 ODI teams in men’s cricket along with the records for matches, points and rating.

In [ ]:
page=requests.get('https://www.icc-cricket.com/rankings/mens/team-rankings/odi')
page

In [ ]:
soup2=BeautifulSoup(page.content)

In [ ]:
team=soup2.find_all('span',class_='u-hide-phablet')
match=soup2.find_all('td',class_='rankings-block__banner--matches')
point=soup2.find_all('td',class_='rankings-block__banner--points')
rating=soup2.find_all('td',class_='rankings-block__banner--rating u-text-right')

In [ ]:
def scrap1(team,n,k):
  ten_team=[]
  j=0
  for i in team:
    #five_book.append(i.text[len(str())+15:-7].replace('\n',''))
    ten_team.append(i.text.replace('\n',''))
    j=j+1
    if j >= n:
      break
  
  return(ten_team[k:n])

In [ ]:
top=pd.DataFrame([scrap1(team,1,0),scrap1(match,1,0),scrap1(point,1,0),scrap1(rating,1,0)]).T

In [ ]:
team=soup2.find_all('span',class_='u-hide-phablet')
match=soup2.find_all('td',class_='table-body__cell u-center-text')
point=soup2.find_all('td',class_='table-body__cell u-center-text')
rating=soup2.find_all('td',class_='table-body__cell u-text-right rating')

In [ ]:
j=0
match1=[]
point1=[]
k=scrap1(match,18,0)
for i in k:
  j=j+1
  if j%2==0:
    point1.append(i)
  elif j%2==1:
    match1.append(i)

In [ ]:
nine=pd.DataFrame([scrap1(team,10,1),match1,point1,scrap1(rating,9,0)]).T

In [ ]:
top_ten=pd.concat([top,nine],axis=0,ignore_index=True)

In [ ]:
top_ten.columns=['country','match','point','rating']

In [ ]:
top_ten

        country match  point rating
0   New Zealand    25     25    118
1     Australia    25  2,945    118
2         India    29  3,344    115
3       England    27  3,100    115
4  South Africa    20  2,137    107
5      Pakistan    24  2,323     97
6    Bangladesh    24  2,157     90
7   West Indies    27  2,222     82
8     Sri Lanka    21  1,652     79
9   Afghanistan    17  1,054     62

## Top 10 ODI Batsmen in men along with the records of their team and rating

In [ ]:
page=requests.get('https://www.icc-cricket.com/rankings/mens/player-rankings/odi')
page

In [ ]:
soup3=BeautifulSoup(page.content)

In [ ]:
def scrap(team,n,k,a,b):
  ten_team=[]
  j=0
  for i in team:
    ten_team.append(i.text[len(str())+a:-b].replace('\n',''))
    #ten_team.append(i.text.replace('\n',''))
    j=j+1
    if j >= n:
      break
  
  return(ten_team[k:n])

In [ ]:
name=soup3.find_all('div',class_='rankings-block__banner--name')
contry=soup3.find_all('div',class_='rankings-block__banner--nationality')
rating=soup3.find_all('div',class_='rankings-block__banner--rating')

In [ ]:
top_bat=pd.DataFrame([scrap(name,1,0,0,1),scrap(contry,1,0,0,32),scrap1(rating,1,0)]).T

In [ ]:
top_bat[1].values

array(['PAK'], dtype=object)

In [ ]:
name=soup3.find_all('td',class_='table-body__cell name')
contry=soup3.find_all('td',class_='table-body__cell nationality-logo')
rating=soup3.find_all('td',class_='table-body__cell u-text-right rating')

In [ ]:
nine_bat=pd.DataFrame([scrap1(name,9,0),scrap1(contry,9,0),scrap1(rating,9,0)]).T

In [ ]:
nine_bat

                     0    1    2
0          Virat Kohli  IND  857
1         Rohit Sharma  IND  825
2          Ross Taylor   NZ  801
3          Aaron Finch  AUS  791
4       Jonny Bairstow  ENG  785
5         Fakhar Zaman  PAK  778
6  Francois du Plessis   SA  778
7         David Warner  AUS  773
8            Shai Hope   WI  773

In [ ]:
bat=pd.concat([top_bat,nine_bat],axis=0,ignore_index=True)

In [ ]:
bat.columns=['Name','con_code','per_Rating']

In [ ]:
bat['country']=bat['con_code'].map({'IND':'India','NZ':'New Zealand','AUS':'Australia','ENG':'England','PAK':'Pakistan','WI':'West Indies','SA':'South Africa','PAK':'Pakistan'})

In [ ]:
bat.merge(top_ten,how='inner').sort_values(by='per_Rating',ascending=False)

                  Name con_code per_Rating       country match  point rating
0            Babar Aza      PAK        865      Pakistan    24  2,323     97
2          Virat Kohli      IND        857         India    29  3,344    115
3         Rohit Sharma      IND        825         India    29  3,344    115
4          Ross Taylor       NZ        801   New Zealand    25     25    118
5          Aaron Finch      AUS        791     Australia    25  2,945    118
7       Jonny Bairstow      ENG        785       England    27  3,100    115
1         Fakhar Zaman      PAK        778      Pakistan    24  2,323     97
8  Francois du Plessis       SA        778  South Africa    20  2,137    107
6         David Warner      AUS        773     Australia    25  2,945    118
9            Shai Hope       WI        773   West Indies    27  2,222     82

## iii)Top 10 ODI bowlers along with the records of their team and rating.

In [ ]:
page=requests.get('https://www.icc-cricket.com/rankings/mens/player-rankings/odi/bowling')
page

In [ ]:
soup3=BeautifulSoup(page.content)

In [ ]:
name=soup3.find_all('div',class_='rankings-block__banner--name-large')
contry=soup3.find_all('div',class_='rankings-block__banner--nationality')
rating=soup3.find_all('div',class_='rankings-block__banner--rating')

In [ ]:
top_ball=pd.DataFrame([scrap(name,1,0,0,1),scrap(contry,1,0,0,20),scrap1(rating,1,0)]).T

In [ ]:
name=soup3.find_all('td',class_='table-body__cell rankings-table__name name')
contry=soup3.find_all('td',class_='table-body__cell nationality-logo rankings-table__team')
rating=soup3.find_all('td',class_='table-body__cell rating')

In [ ]:
nine_ball=pd.DataFrame([scrap(name,9,0,0,1),scrap(contry,9,0,0,1),scrap1(rating,9,0)]).T

In [ ]:
ball=pd.concat([top_ball,nine_ball],axis=0,ignore_index=True)

In [ ]:
ball.columns=['Name','con_code','per_rating']

In [ ]:
ball['country']=ball['con_code'].map({'IND':'India','NZ':'New Zealand','AUS':'Australia','ENG':'England','PAK':'Pakistan','WI':'West Indies','SA':'South Africa','PAK':'Pakistan','AFG':'Afghanistan','BAN':'Bangladesh'})

In [ ]:
ball

               Name con_code per_rating       country
0        Trent Boul       NZ        737   New Zealand
1  Mujeeb Ur Rahman      AFG        708   Afghanistan
2        Matt Henry       NZ        691   New Zealand
3    Jasprit Bumrah      IND        690         India
4      Mehedi Hasan      BAN        668    Bangladesh
5     Kagiso Rabada       SA        666  South Africa
6      Chris Woakes      ENG        665       England
7    Josh Hazlewood      AUS        660     Australia
8       Pat Cummins      AUS        646     Australia
9     Mohammad Amir      PAK        638      Pakistan

In [ ]:
ball.merge(top_ten,how='inner').sort_values(by='per_rating',ascending=False)

               Name con_code per_rating       country match  point rating
0        Trent Boul       NZ        737   New Zealand    25     25    118
2  Mujeeb Ur Rahman      AFG        708   Afghanistan    17  1,054     62
1        Matt Henry       NZ        691   New Zealand    25     25    118
3    Jasprit Bumrah      IND        690         India    29  3,344    115
4      Mehedi Hasan      BAN        668    Bangladesh    24  2,157     90
5     Kagiso Rabada       SA        666  South Africa    20  2,137    107
6      Chris Woakes      ENG        665       England    27  3,100    115
7    Josh Hazlewood      AUS        660     Australia    25  2,945    118
8       Pat Cummins      AUS        646     Australia    25  2,945    118
9     Mohammad Amir      PAK        638      Pakistan    24  2,323     97

# Write a python program to scrape cricket rankings from ‘www.icc-cricket.com’. You have to scrape:

## Top 10 ODI teams in women’s cricket along with the records for matches, points and rating.

In [ ]:
page=requests.get('https://www.icc-cricket.com/rankings/womens/team-rankings/odi')
page

In [ ]:
soup2=BeautifulSoup(page.content)

In [ ]:
team=soup2.find_all('span',class_='u-hide-phablet')
match=soup2.find_all('td',class_='rankings-block__banner--matches')
point=soup2.find_all('td',class_='rankings-block__banner--points')
rating=soup2.find_all('td',class_='rankings-block__banner--rating u-text-right')

In [ ]:
def scrap1(team,n,k):
  ten_team=[]
  j=0
  for i in team:
    #five_book.append(i.text[len(str())+15:-7].replace('\n',''))
    ten_team.append(i.text.replace('\n',''))
    j=j+1
    if j >= n:
      break
  
  return(ten_team[k:n])

In [ ]:
top=pd.DataFrame([scrap1(team,1,0),scrap1(match,1,0),scrap1(point,1,0),scrap1(rating,1,0)]).T

In [ ]:
team=soup2.find_all('span',class_='u-hide-phablet')
match=soup2.find_all('td',class_='table-body__cell u-center-text')
point=soup2.find_all('td',class_='table-body__cell u-center-text')
rating=soup2.find_all('td',class_='table-body__cell u-text-right rating')

In [ ]:
j=0
match1=[]
point1=[]
k=scrap1(match,18,0)
for i in k:
  j=j+1
  if j%2==0:
    point1.append(i)
  elif j%2==1:
    match1.append(i)

In [ ]:
nine=pd.DataFrame([scrap1(team,10,1),match1,point1,scrap1(rating,9,0)]).T

In [ ]:
top_ten=pd.concat([top,nine],axis=0,ignore_index=True)

In [ ]:
top_ten.columns=['country','match','point','rating']

In [ ]:
top_ten

        country match  point                                             rating
0     Australia    18  2,955                              164               ...
1  South Africa    24  2,828                                                118
2       England    17  1,993                                                117
3         India    20  2,226                                                111
4   New Zealand    21  1,947                                                 93
5   West Indies    12  1,025                                                 85
6      Pakistan    15  1,101                                                 73
7    Bangladesh     5    306                                                 61
8     Sri Lanka    11    519                                                 47
9       Ireland     2     25                                                 13

## Top 10 women’s ODI players along with the records of their team and rating.

In [ ]:
page=requests.get('https://www.icc-cricket.com/rankings/womens/player-rankings/odi')
page

In [ ]:
soup3=BeautifulSoup(page.content)

In [ ]:
def scrap(team,n,k,a,b):
  ten_team=[]
  j=0
  for i in team:
    ten_team.append(i.text[len(str())+a:-b].replace('\n',''))
    #ten_team.append(i.text.replace('\n',''))
    j=j+1
    if j >= n:
      break
  
  return(ten_team[k:n])

In [ ]:
name=soup3.find_all('div',class_='rankings-block__banner--name')
contry=soup3.find_all('div',class_='rankings-block__banner--nationality')
rating=soup3.find_all('div',class_='rankings-block__banner--rating')

In [ ]:
top_bat=pd.DataFrame([scrap(name,1,0,0,1),scrap(contry,1,0,0,32),scrap1(rating,1,0)]).T

In [ ]:
top_bat[1].values

array(['ENG'], dtype=object)

In [ ]:
name=soup3.find_all('td',class_='table-body__cell name')
contry=soup3.find_all('td',class_='table-body__cell nationality-logo')
rating=soup3.find_all('td',class_='table-body__cell u-text-right rating')

In [ ]:
nine_bat=pd.DataFrame([scrap1(name,9,0),scrap1(contry,9,0),scrap1(rating,9,0)]).T

In [ ]:
nine_bat

                   0    1    2
0        Lizelle Lee   SA  758
1       Alyssa Healy  AUS  756
2    Stafanie Taylor   WI  746
3        Meg Lanning  AUS  723
4  Amy Satterthwaite   NZ  715
5    Smriti Mandhana  IND  710
6        Mithali Raj  IND  709
7     Natalie Sciver  ENG  685
8    Laura Wolvaardt   SA  683

In [ ]:
bat=pd.concat([top_bat,nine_bat],axis=0,ignore_index=True)

In [ ]:
bat.columns=['Name','con_code','per_Rating']

In [ ]:
bat['country']=bat['con_code'].map({'IND':'India','NZ':'New Zealand','AUS':'Australia','ENG':'England','PAK':'Pakistan','WI':'West Indies','SA':'South Africa','PAK':'Pakistan'})

In [ ]:
bat.merge(top_ten,how='inner').sort_values(by='per_Rating',ascending=False)

                Name  ...                                             rating
0      Tammy Beaumon  ...                                                117
2        Lizelle Lee  ...                                                118
4       Alyssa Healy  ...                              164               ...
6    Stafanie Taylor  ...                                                 85
5        Meg Lanning  ...                              164               ...
7  Amy Satterthwaite  ...                                                 93
8    Smriti Mandhana  ...                                                111
9        Mithali Raj  ...                                                111
1     Natalie Sciver  ...                                                117
3    Laura Wolvaardt  ...                                                118

[10 rows x 7 columns]

## Top 10 women’s ODI all-rounder along with the records of their team and rating.

In [ ]:
page=requests.get('https://www.icc-cricket.com/rankings/womens/player-rankings/odi/bowling')
page

In [ ]:
soup3=BeautifulSoup(page.content)

In [ ]:
name=soup3.find_all('div',class_='rankings-block__banner--name-large')
contry=soup3.find_all('div',class_='rankings-block__banner--nationality')
rating=soup3.find_all('div',class_='rankings-block__banner--rating')

In [ ]:
top_ball=pd.DataFrame([scrap(name,1,0,0,1),scrap(contry,1,0,0,20),scrap1(rating,1,0)]).T

In [ ]:
name=soup3.find_all('td',class_='table-body__cell rankings-table__name name')
contry=soup3.find_all('td',class_='table-body__cell nationality-logo rankings-table__team')
rating=soup3.find_all('td',class_='table-body__cell rating')

In [ ]:
nine_ball=pd.DataFrame([scrap(name,9,0,0,1),scrap(contry,9,0,0,1),scrap1(rating,9,0)]).T

In [ ]:
ball=pd.concat([top_ball,nine_ball],axis=0,ignore_index=True)

In [ ]:
ball.columns=['Name','con_code','per_rating']

In [ ]:
ball['country']=ball['con_code'].map({'IND':'India','NZ':'New Zealand','AUS':'Australia','ENG':'England','PAK':'Pakistan','WI':'West Indies','SA':'South Africa','PAK':'Pakistan','AFG':'Afghanistan','BAN':'Bangladesh'})

In [ ]:
ball

              Name con_code per_rating       country
0     Jess Jonasse      AUS        808     Australia
1     Megan Schutt      AUS        762     Australia
2   Marizanne Kapp       SA        747  South Africa
3   Shabnim Ismail       SA        717  South Africa
4   Jhulan Goswami      IND        681         India
5  Katherine Brunt      ENG        655       England
6     Poonam Yadav      IND        641         India
7   Ayabonga Khaka       SA        638  South Africa
8     Ellyse Perry      AUS        616     Australia
9    Shikha Pandey      IND        610         India

In [ ]:
ball.merge(top_ten,how='inner').sort_values(by='per_rating',ascending=False)

              Name  ...                                             rating
0     Jess Jonasse  ...                              164               ...
1     Megan Schutt  ...                              164               ...
3   Marizanne Kapp  ...                                                118
4   Shabnim Ismail  ...                                                118
6   Jhulan Goswami  ...                                                111
9  Katherine Brunt  ...                                                117
7     Poonam Yadav  ...                                                111
5   Ayabonga Khaka  ...                                                118
2     Ellyse Perry  ...                              164               ...
8    Shikha Pandey  ...                                                111

[10 rows x 7 columns]

# Write a python program to scrape details of all the mobile phones under Rs. 20,000 listed on Amazon.in. The scraped data should include Product Name, Price, Image URL and Average Rating

In [ ]:
def scrap2(team):
  ten_team=[]
  for i in team:
    #ten_team.append(i.text[len(str())+a:-b].replace('\n',''))
    ten_team.append(i.text.replace('\n',''))
  
  return(ten_team)

In [ ]:
page=requests.get('https://www.amazon.in/s?bbn=1389401031&rh=n%3A1389401031%2Cp_36%3A1318506031&dc&qid=1620098046&rnid=1318502031&ref=lp_1389401031_nr_p_36_3')
page

In [ ]:
page2=requests.get('https://www.amazon.in/s?i=electronics&bbn=1389401031&rh=n%3A1389401031%2Cp_36%3A300000-2000000&dc&page=2&qid=1620098957&rnid=1318502031&ref=sr_pg_2')
page2

In [ ]:
page3=requests.get('https://www.amazon.in/s?i=electronics&bbn=1389401031&rh=n%3A1389401031%2Cp_36%3A300000-2000000&dc&page=3&qid=1620098683&rnid=1318502031&ref=sr_pg_3')
page3

In [ ]:
soup3=BeautifulSoup(page.content)

In [ ]:
mobile1=pd.DataFrame(columns=['name','price','rating','img_url'])
def pa(page):
  soup3=BeautifulSoup(page.content)
  name=soup3.find_all('span',class_='a-size-base-plus a-color-base a-text-normal')
  price=soup3.find_all('span',class_='a-price-whole')
  img_url=soup3.find_all('img',class_='s-image')
  avg_rat=soup3.find_all('span',class_='a-icon-alt')
  img=[]
  for i in img_url:
    img.append(i.get('src'))
  mobile=pd.DataFrame([scrap2(name),scrap2(price),scrap(avg_rat,50,0,0,-3)]).T
  mobile=mobile.loc[mobile[2].str.contains('S')==False]
  mobile=pd.concat([mobile,pd.DataFrame(img)],axis=1)
  mobile.columns=['name','price','rating','img_url']
  mob_name=[]
  for i in mobile['name']:
    sep = '('
    stripped = i.split(sep, 1)[0]
    mob_name.append(stripped)
  mobile['name']=mob_name
  return(mobile)



pd.concat([pa(page),pa(page2),pa(page3)],axis=0,ignore_index=True)

                                                 name  ...                                            img_url
0                                 Samsung Galaxy M31   ...  https://m.media-amazon.com/images/I/71-Su4Wr0H...
1                                 Samsung Galaxy M31   ...  https://m.media-amazon.com/images/I/71OxJeyywS...
2                                      Redmi Note 10   ...  https://m.media-amazon.com/images/I/71IqJQM2st...
3                                      Redmi Note 10   ...  https://m.media-amazon.com/images/I/71Kmfs0T0B...
4                                      Redmi Note 10   ...  https://m.media-amazon.com/images/I/71Kmfs0T0B...
..                                                ...  ...                                                ...
67  Fire-Boltt Beast SPO2 1.69" Full Touch Large H...  ...  https://m.media-amazon.com/images/I/61MKnhvNUg...
68                                          Oppo A52   ...  https://m.media-amazon.com/images/I/71FPmXaDfb...
69                                          Redmi 9A   ...  https://m.media-amazon.com/images/I/71sxlhYhKW...
70                                          OPPO A31   ...  https://m.media-amazon.com/images/I/71AHtKejSl...
71  Nokia 5310 Dual SIM Feature Phone with MP3 Pla...  ...  https://m.media-amazon.com/images/I/4192aJrFBi...

[72 rows x 4 columns]

# Write a python program to extract information about the local weather from the National Weather Service website of USA, https://www.weather.gov/ for the city, San Francisco. You need to extract data about 7 day extended forecast display for the city. The data should include period, short description, temperature and description.

In [29]:
page=requests.get('https://forecast.weather.gov/MapClick.php?lat=37.7739&lon=-122.4312#.YJKaL7UzbIU')
page

In [30]:
def scrap2(team):
  ten_team=[]
  for i in team:
    #ten_team.append(i.text[len(str())+a:-b].replace('\n',''))
    ten_team.append(i.text.replace('\n',''))
  
  return(ten_team)

In [31]:
soup3=BeautifulSoup(page.content)
dis=soup3.find_all('div',class_='col-sm-10 forecast-text')
label=soup3.find_all('div',class_='col-sm-2 forecast-label')

In [32]:
label=scrap2(label)

In [33]:
dis=scrap2(dis)

In [34]:
temp=[]
short_dis=[]
for i in dis:
    short_dis.append(i.split(',', 1)[0])
    temp.append(i.split('.', 1)[0][-2:])

In [35]:
pd.DataFrame([label,short_dis,temp,dis]).T

                  0  ...                                                  3
0         Overnight  ...  Clear, with a low around 51. West northwest wi...
1          Saturday  ...  Sunny, with a high near 71. Northwest wind 7 t...
2    Saturday Night  ...  Mostly clear, with a low around 52. West wind ...
3            Sunday  ...  Sunny, with a high near 70. West wind 8 to 16 ...
4      Sunday Night  ...  Clear, with a low around 52. West northwest wi...
5            Monday  ...                        Sunny, with a high near 72.
6      Monday Night  ...                Mostly clear, with a low around 52.
7           Tuesday  ...                        Sunny, with a high near 73.
8     Tuesday Night  ...                Mostly clear, with a low around 50.
9         Wednesday  ...                        Sunny, with a high near 68.
10  Wednesday Night  ...               Partly cloudy, with a low around 51.
11         Thursday  ...                 Mostly sunny, with a high near 65.
12   Thursday Night  ...                Mostly clear, with a low around 50.
13           Friday  ...                        Sunny, with a high near 65.

[14 rows x 4 columns]